{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.0.6", "config": {"name": "model_3", "output_layers": [["dense_6", 0, 0]], "input_layers": [["input_3", 0, 0]], "layers": [{"name": "input_3", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_3", "batch_input_shape": [null, 32, 32, 1], "dtype": "float32", "sparse": false}}, {"name": "conv2d_9", "class_name": "Conv2D", "inbound_nodes": [[["input_3", 0, 0, {}]]], "config": {"name": "conv2d_9", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "padding": "valid", "filters": 108, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "trainable": true}}, {"name": "conv2d_10", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"name": "conv2d_10", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "padding": "valid", "filters": 108, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "trainable": true}}, {"name": "max_pooling2d_7", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"name": "max_pooling2d_7", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}}, {"name": "dropout_7", "class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_7", 0, 0, {}]]], "config": {"name": "dropout_7", "rate": 0.2, "trainable": true}}, {"name": "conv2d_11", "class_name": "Conv2D", "inbound_nodes": [[["dropout_7", 0, 0, {}]]], "config": {"name": "conv2d_11", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "padding": "valid", "filters": 200, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "trainable": true}}, {"name": "conv2d_12", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"name": "conv2d_12", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "padding": "valid", "filters": 200, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "trainable": true}}, {"name": "max_pooling2d_9", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"name": "max_pooling2d_9", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}}, {"name": "max_pooling2d_8", "class_name": "MaxPooling2D", "inbound_nodes": [[["dropout_7", 0, 0, {}]]], "config": {"name": "max_pooling2d_8", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}}, {"name": "dropout_8", "class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_9", 0, 0, {}]]], "config": {"name": "dropout_8", "rate": 0.2, "trainable": true}}, {"name": "flatten_5", "class_name": "Flatten", "inbound_nodes": [[["max_pooling2d_8", 0, 0, {}]]], "config": {"name": "flatten_5", "trainable": true}}, {"name": "flatten_6", "class_name": "Flatten", "inbound_nodes": [[["dropout_8", 0, 0, {}]]], "config": {"name": "flatten_6", "trainable": true}}, {"name": "merge_3", "class_name": "Merge", "inbound_nodes": [[["flatten_5", 0, 0, {"mask": [null, null]}], ["flatten_6", 0, 0, {"mask": [null, null]}]]], "config": {"name": "merge_3", "mode_type": "raw", "concat_axis": 1, "dot_axes": -1, "mode": "concat", "output_shape_type": "raw", "arguments": {}, "output_mask": null, "output_shape": null, "output_mask_type": "raw"}}, {"name": "dense_5", "class_name": "Dense", "inbound_nodes": [[["merge_3", 0, 0, {}]]], "config": {"name": "dense_5", "use_bias": true, "units": 100, "activation": "sigmoid", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null}}, {"name": "dropout_9", "class_name": "Dropout", "inbound_nodes": [[["dense_5", 0, 0, {}]]], "config": {"name": "dropout_9", "rate": 0.5, "trainable": true}}, {"name": "dense_6", "class_name": "Dense", "inbound_nodes": [[["dropout_9", 0, 0, {}]]], "config": {"name": "dense_6", "use_bias": true, "units": 43, "activation": "softmax", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null}}]}}