{"class_name": "Model", "config": {"input_layers": [["input_3", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_3", "config": {"batch_input_shape": [null, 32, 32, 1], "name": "input_3", "sparse": false, "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_9", "config": {"activity_regularizer": null, "trainable": true, "name": "conv2d_9", "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "valid", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "filters": 32, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_10", "config": {"activity_regularizer": null, "trainable": true, "name": "conv2d_10", "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "valid", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "filters": 32, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_7", "config": {"trainable": true, "name": "max_pooling2d_7", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "padding": "valid"}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_7", "config": {"trainable": true, "name": "dropout_7", "rate": 0.2}, "inbound_nodes": [[["max_pooling2d_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_11", "config": {"activity_regularizer": null, "trainable": true, "name": "conv2d_11", "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "valid", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "filters": 64, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["dropout_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_12", "config": {"activity_regularizer": null, "trainable": true, "name": "conv2d_12", "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "valid", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "filters": 64, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_9", "config": {"trainable": true, "name": "max_pooling2d_9", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "padding": "valid"}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_8", "config": {"trainable": true, "name": "dropout_8", "rate": 0.2}, "inbound_nodes": [[["max_pooling2d_9", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_3", "config": {"trainable": true, "name": "flatten_3"}, "inbound_nodes": [[["dropout_8", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_5", "config": {"activity_regularizer": null, "trainable": true, "name": "dense_5", "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "units": 256, "activation": "sigmoid", "bias_constraint": null, "kernel_constraint": null}, "inbound_nodes": [[["flatten_3", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_9", "config": {"trainable": true, "name": "dropout_9", "rate": 0.5}, "inbound_nodes": [[["dense_5", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_6", "config": {"activity_regularizer": null, "trainable": true, "name": "dense_6", "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "units": 43, "activation": "softmax", "bias_constraint": null, "kernel_constraint": null}, "inbound_nodes": [[["dropout_9", 0, 0, {}]]]}], "name": "model_3", "output_layers": [["dense_6", 0, 0]]}, "keras_version": "2.0.6", "backend": "tensorflow"}