{"keras_version": "2.0.6", "class_name": "Model", "backend": "tensorflow", "config": {"name": "model_4", "output_layers": [["dense_8", 0, 0]], "layers": [{"name": "input_4", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_4", "sparse": false, "batch_input_shape": [null, 32, 32, 1], "dtype": "float32"}}, {"name": "conv2d_13", "class_name": "Conv2D", "inbound_nodes": [[["input_4", 0, 0, {}]]], "config": {"bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "activation": "relu", "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "trainable": true, "padding": "valid", "filters": 108, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_13", "bias_regularizer": null}}, {"name": "conv2d_14", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "config": {"bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "activation": "relu", "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "trainable": true, "padding": "valid", "filters": 108, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_14", "bias_regularizer": null}}, {"name": "max_pooling2d_10", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "config": {"pool_size": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_10", "strides": [2, 2]}}, {"name": "dropout_10", "class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_10", 0, 0, {}]]], "config": {"name": "dropout_10", "trainable": true, "rate": 0.2}}, {"name": "conv2d_15", "class_name": "Conv2D", "inbound_nodes": [[["dropout_10", 0, 0, {}]]], "config": {"bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "activation": "relu", "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "trainable": true, "padding": "valid", "filters": 108, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_15", "bias_regularizer": null}}, {"name": "conv2d_16", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "config": {"bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "activation": "relu", "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "trainable": true, "padding": "valid", "filters": 108, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_16", "bias_regularizer": null}}, {"name": "max_pooling2d_12", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "config": {"pool_size": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_12", "strides": [2, 2]}}, {"name": "max_pooling2d_11", "class_name": "MaxPooling2D", "inbound_nodes": [[["dropout_10", 0, 0, {}]]], "config": {"pool_size": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_11", "strides": [2, 2]}}, {"name": "dropout_11", "class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_12", 0, 0, {}]]], "config": {"name": "dropout_11", "trainable": true, "rate": 0.2}}, {"name": "flatten_7", "class_name": "Flatten", "inbound_nodes": [[["max_pooling2d_11", 0, 0, {}]]], "config": {"name": "flatten_7", "trainable": true}}, {"name": "flatten_8", "class_name": "Flatten", "inbound_nodes": [[["dropout_11", 0, 0, {}]]], "config": {"name": "flatten_8", "trainable": true}}, {"name": "merge_4", "class_name": "Merge", "inbound_nodes": [[["flatten_7", 0, 0, {"mask": [null, null]}], ["flatten_8", 0, 0, {"mask": [null, null]}]]], "config": {"output_mask": null, "output_shape": null, "concat_axis": 1, "dot_axes": -1, "output_mask_type": "raw", "mode": "concat", "name": "merge_4", "output_shape_type": "raw", "arguments": {}, "mode_type": "raw"}}, {"name": "dense_7", "class_name": "Dense", "inbound_nodes": [[["merge_4", 0, 0, {}]]], "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "sigmoid", "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "trainable": true, "kernel_constraint": null, "name": "dense_7", "bias_regularizer": null, "units": 100}}, {"name": "dropout_12", "class_name": "Dropout", "inbound_nodes": [[["dense_7", 0, 0, {}]]], "config": {"name": "dropout_12", "trainable": true, "rate": 0.5}}, {"name": "dense_8", "class_name": "Dense", "inbound_nodes": [[["dropout_12", 0, 0, {}]]], "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "softmax", "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "trainable": true, "kernel_constraint": null, "name": "dense_8", "bias_regularizer": null, "units": 43}}], "input_layers": [["input_4", 0, 0]]}}