{"class_name": "Model", "config": {"input_layers": [["input_2", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_2", "config": {"batch_input_shape": [null, 32, 32, 1], "name": "input_2", "sparse": false, "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_5", "config": {"activity_regularizer": null, "trainable": true, "name": "conv2d_5", "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "valid", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "filters": 32, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_6", "config": {"activity_regularizer": null, "trainable": true, "name": "conv2d_6", "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "valid", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "filters": 32, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_4", "config": {"trainable": true, "name": "max_pooling2d_4", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "padding": "valid"}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_4", "config": {"trainable": true, "name": "dropout_4", "rate": 0.2}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_7", "config": {"activity_regularizer": null, "trainable": true, "name": "conv2d_7", "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "valid", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "filters": 64, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_8", "config": {"activity_regularizer": null, "trainable": true, "name": "conv2d_8", "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "valid", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "filters": 64, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_6", "config": {"trainable": true, "name": "max_pooling2d_6", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "padding": "valid"}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_5", "config": {"trainable": true, "name": "dropout_5", "rate": 0.2}, "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_2", "config": {"trainable": true, "name": "flatten_2"}, "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_3", "config": {"activity_regularizer": null, "trainable": true, "name": "dense_3", "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "units": 256, "activation": "sigmoid", "bias_constraint": null, "kernel_constraint": null}, "inbound_nodes": [[["flatten_2", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_6", "config": {"trainable": true, "name": "dropout_6", "rate": 0.5}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_4", "config": {"activity_regularizer": null, "trainable": true, "name": "dense_4", "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "units": 43, "activation": "softmax", "bias_constraint": null, "kernel_constraint": null}, "inbound_nodes": [[["dropout_6", 0, 0, {}]]]}], "name": "model_2", "output_layers": [["dense_4", 0, 0]]}, "keras_version": "2.0.6", "backend": "tensorflow"}