{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.0.6", "config": {"name": "model_5", "output_layers": [["dense_10", 0, 0]], "input_layers": [["input_5", 0, 0]], "layers": [{"name": "input_5", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_5", "batch_input_shape": [null, 32, 32, 1], "dtype": "float32", "sparse": false}}, {"name": "conv2d_17", "class_name": "Conv2D", "inbound_nodes": [[["input_5", 0, 0, {}]]], "config": {"name": "conv2d_17", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "padding": "valid", "filters": 32, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "trainable": true}}, {"name": "conv2d_18", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "config": {"name": "conv2d_18", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "padding": "valid", "filters": 32, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "trainable": true}}, {"name": "max_pooling2d_13", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "config": {"name": "max_pooling2d_13", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}}, {"name": "dropout_13", "class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_13", 0, 0, {}]]], "config": {"name": "dropout_13", "rate": 0.2, "trainable": true}}, {"name": "conv2d_19", "class_name": "Conv2D", "inbound_nodes": [[["dropout_13", 0, 0, {}]]], "config": {"name": "conv2d_19", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "padding": "valid", "filters": 64, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "trainable": true}}, {"name": "conv2d_20", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "config": {"name": "conv2d_20", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "padding": "valid", "filters": 64, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "trainable": true}}, {"name": "max_pooling2d_15", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "config": {"name": "max_pooling2d_15", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}}, {"name": "max_pooling2d_14", "class_name": "MaxPooling2D", "inbound_nodes": [[["dropout_13", 0, 0, {}]]], "config": {"name": "max_pooling2d_14", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}}, {"name": "dropout_14", "class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_15", 0, 0, {}]]], "config": {"name": "dropout_14", "rate": 0.2, "trainable": true}}, {"name": "flatten_9", "class_name": "Flatten", "inbound_nodes": [[["max_pooling2d_14", 0, 0, {}]]], "config": {"name": "flatten_9", "trainable": true}}, {"name": "flatten_10", "class_name": "Flatten", "inbound_nodes": [[["dropout_14", 0, 0, {}]]], "config": {"name": "flatten_10", "trainable": true}}, {"name": "merge_5", "class_name": "Merge", "inbound_nodes": [[["flatten_9", 0, 0, {"mask": [null, null]}], ["flatten_10", 0, 0, {"mask": [null, null]}]]], "config": {"name": "merge_5", "mode_type": "raw", "concat_axis": 1, "dot_axes": -1, "mode": "concat", "output_shape_type": "raw", "arguments": {}, "output_mask": null, "output_shape": null, "output_mask_type": "raw"}}, {"name": "dense_9", "class_name": "Dense", "inbound_nodes": [[["merge_5", 0, 0, {}]]], "config": {"name": "dense_9", "use_bias": true, "units": 256, "activation": "sigmoid", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null}}, {"name": "dropout_15", "class_name": "Dropout", "inbound_nodes": [[["dense_9", 0, 0, {}]]], "config": {"name": "dropout_15", "rate": 0.5, "trainable": true}}, {"name": "dense_10", "class_name": "Dense", "inbound_nodes": [[["dropout_15", 0, 0, {}]]], "config": {"name": "dense_10", "use_bias": true, "units": 43, "activation": "softmax", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null}}]}}