{"keras_version": "2.0.6", "class_name": "Model", "backend": "tensorflow", "config": {"name": "model_5", "output_layers": [["dense_10", 0, 0]], "layers": [{"name": "input_5", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_5", "sparse": false, "batch_input_shape": [null, 32, 32, 1], "dtype": "float32"}}, {"name": "conv2d_17", "class_name": "Conv2D", "inbound_nodes": [[["input_5", 0, 0, {}]]], "config": {"bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "activation": "relu", "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "trainable": true, "padding": "valid", "filters": 108, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_17", "bias_regularizer": null}}, {"name": "conv2d_18", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "config": {"bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "activation": "relu", "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "trainable": true, "padding": "valid", "filters": 108, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_18", "bias_regularizer": null}}, {"name": "max_pooling2d_13", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "config": {"pool_size": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_13", "strides": [2, 2]}}, {"name": "dropout_13", "class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_13", 0, 0, {}]]], "config": {"name": "dropout_13", "trainable": true, "rate": 0.2}}, {"name": "conv2d_19", "class_name": "Conv2D", "inbound_nodes": [[["dropout_13", 0, 0, {}]]], "config": {"bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "activation": "relu", "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "trainable": true, "padding": "valid", "filters": 108, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_19", "bias_regularizer": null}}, {"name": "conv2d_20", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "config": {"bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "activation": "relu", "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "trainable": true, "padding": "valid", "filters": 108, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_20", "bias_regularizer": null}}, {"name": "max_pooling2d_15", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "config": {"pool_size": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_15", "strides": [2, 2]}}, {"name": "max_pooling2d_14", "class_name": "MaxPooling2D", "inbound_nodes": [[["dropout_13", 0, 0, {}]]], "config": {"pool_size": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_14", "strides": [2, 2]}}, {"name": "dropout_14", "class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_15", 0, 0, {}]]], "config": {"name": "dropout_14", "trainable": true, "rate": 0.2}}, {"name": "flatten_9", "class_name": "Flatten", "inbound_nodes": [[["max_pooling2d_14", 0, 0, {}]]], "config": {"name": "flatten_9", "trainable": true}}, {"name": "flatten_10", "class_name": "Flatten", "inbound_nodes": [[["dropout_14", 0, 0, {}]]], "config": {"name": "flatten_10", "trainable": true}}, {"name": "merge_5", "class_name": "Merge", "inbound_nodes": [[["flatten_9", 0, 0, {"mask": [null, null]}], ["flatten_10", 0, 0, {"mask": [null, null]}]]], "config": {"output_mask": null, "output_shape": null, "concat_axis": 1, "dot_axes": -1, "output_mask_type": "raw", "mode": "concat", "name": "merge_5", "output_shape_type": "raw", "arguments": {}, "mode_type": "raw"}}, {"name": "dense_9", "class_name": "Dense", "inbound_nodes": [[["merge_5", 0, 0, {}]]], "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "sigmoid", "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "trainable": true, "kernel_constraint": null, "name": "dense_9", "bias_regularizer": null, "units": 100}}, {"name": "dropout_15", "class_name": "Dropout", "inbound_nodes": [[["dense_9", 0, 0, {}]]], "config": {"name": "dropout_15", "trainable": true, "rate": 0.5}}, {"name": "dense_10", "class_name": "Dense", "inbound_nodes": [[["dropout_15", 0, 0, {}]]], "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "softmax", "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "trainable": true, "kernel_constraint": null, "name": "dense_10", "bias_regularizer": null, "units": 43}}], "input_layers": [["input_5", 0, 0]]}}