{"class_name": "Model", "config": {"input_layers": [["input_4", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_4", "config": {"batch_input_shape": [null, 32, 32, 1], "name": "input_4", "sparse": false, "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_13", "config": {"activity_regularizer": null, "trainable": true, "name": "conv2d_13", "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "valid", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "filters": 108, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_14", "config": {"activity_regularizer": null, "trainable": true, "name": "conv2d_14", "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "valid", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "filters": 108, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_10", "config": {"trainable": true, "name": "max_pooling2d_10", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "padding": "valid"}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_10", "config": {"trainable": true, "name": "dropout_10", "rate": 0.2}, "inbound_nodes": [[["max_pooling2d_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_15", "config": {"activity_regularizer": null, "trainable": true, "name": "conv2d_15", "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "valid", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "filters": 108, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["dropout_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_16", "config": {"activity_regularizer": null, "trainable": true, "name": "conv2d_16", "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "valid", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "filters": 108, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_12", "config": {"trainable": true, "name": "max_pooling2d_12", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "padding": "valid"}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_11", "config": {"trainable": true, "name": "dropout_11", "rate": 0.2}, "inbound_nodes": [[["max_pooling2d_12", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_4", "config": {"trainable": true, "name": "flatten_4"}, "inbound_nodes": [[["dropout_11", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_7", "config": {"activity_regularizer": null, "trainable": true, "name": "dense_7", "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "units": 100, "activation": "sigmoid", "bias_constraint": null, "kernel_constraint": null}, "inbound_nodes": [[["flatten_4", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_12", "config": {"trainable": true, "name": "dropout_12", "rate": 0.5}, "inbound_nodes": [[["dense_7", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_8", "config": {"activity_regularizer": null, "trainable": true, "name": "dense_8", "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "units": 43, "activation": "softmax", "bias_constraint": null, "kernel_constraint": null}, "inbound_nodes": [[["dropout_12", 0, 0, {}]]]}], "name": "model_4", "output_layers": [["dense_8", 0, 0]]}, "keras_version": "2.0.6", "backend": "tensorflow"}