{"class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 32, 32, 1], "name": "input_1", "sparse": false, "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_1", "config": {"activity_regularizer": null, "trainable": true, "name": "conv2d_1", "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "valid", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "filters": 32, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2", "config": {"activity_regularizer": null, "trainable": true, "name": "conv2d_2", "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "valid", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "filters": 32, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "config": {"trainable": true, "name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "padding": "valid"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_1", "config": {"trainable": true, "name": "dropout_1", "rate": 0.2}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_3", "config": {"activity_regularizer": null, "trainable": true, "name": "conv2d_3", "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "valid", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "filters": 64, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_4", "config": {"activity_regularizer": null, "trainable": true, "name": "conv2d_4", "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "padding": "valid", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "filters": 64, "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_3", "config": {"trainable": true, "name": "max_pooling2d_3", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "padding": "valid"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_2", "config": {"trainable": true, "name": "dropout_2", "rate": 0.2}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_1", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"activity_regularizer": null, "trainable": true, "name": "dense_1", "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "units": 256, "activation": "sigmoid", "bias_constraint": null, "kernel_constraint": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_3", "config": {"trainable": true, "name": "dropout_3", "rate": 0.5}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_2", "config": {"activity_regularizer": null, "trainable": true, "name": "dense_2", "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "units": 43, "activation": "softmax", "bias_constraint": null, "kernel_constraint": null}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}], "name": "model_1", "output_layers": [["dense_2", 0, 0]]}, "keras_version": "2.0.6", "backend": "tensorflow"}