{"config": {"name": "model_2", "input_layers": [["input_2", 0, 0]], "output_layers": [["dense_4", 0, 0]], "layers": [{"name": "input_2", "config": {"name": "input_2", "batch_input_shape": [null, 32, 32, 1], "dtype": "float32", "sparse": false}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "conv2d_5", "config": {"kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv2d_5", "bias_constraint": null, "filters": 108, "padding": "valid", "trainable": true, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "conv2d_6", "config": {"kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv2d_6", "bias_constraint": null, "filters": 108, "padding": "valid", "trainable": true, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "max_pooling2d_4", "config": {"pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_4", "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"name": "dropout_4", "config": {"name": "dropout_4", "trainable": true, "rate": 0.0}, "class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"name": "conv2d_7", "config": {"kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv2d_7", "bias_constraint": null, "filters": 108, "padding": "valid", "trainable": true, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"name": "conv2d_8", "config": {"kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv2d_8", "bias_constraint": null, "filters": 108, "padding": "valid", "trainable": true, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"name": "max_pooling2d_6", "config": {"pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_6", "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"name": "max_pooling2d_5", "config": {"pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_5", "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D", "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"name": "dropout_5", "config": {"name": "dropout_5", "trainable": true, "rate": 0.0}, "class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]]}, {"name": "flatten_3", "config": {"name": "flatten_3", "trainable": true}, "class_name": "Flatten", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]]}, {"name": "flatten_4", "config": {"name": "flatten_4", "trainable": true}, "class_name": "Flatten", "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"name": "merge_2", "config": {"output_shape": null, "name": "merge_2", "mode_type": "raw", "arguments": {}, "output_mask": null, "dot_axes": -1, "output_shape_type": "raw", "concat_axis": 1, "output_mask_type": "raw", "mode": "concat"}, "class_name": "Merge", "inbound_nodes": [[["flatten_3", 0, 0, {"mask": [null, null]}], ["flatten_4", 0, 0, {"mask": [null, null]}]]]}, {"name": "dense_3", "config": {"kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "sigmoid", "units": 100, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_3", "bias_constraint": null, "trainable": true, "bias_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["merge_2", 0, 0, {}]]]}, {"name": "dropout_6", "config": {"name": "dropout_6", "trainable": true, "rate": 0.0}, "class_name": "Dropout", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"name": "dense_4", "config": {"kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "units": 43, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_4", "bias_constraint": null, "trainable": true, "bias_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["dropout_6", 0, 0, {}]]]}]}, "keras_version": "2.0.6", "class_name": "Model", "backend": "tensorflow"}