{"config": {"layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, 32, 32, 3], "name": "input_2", "sparse": false}, "inbound_nodes": [], "name": "input_2", "class_name": "InputLayer"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 108, "bias_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "strides": [1, 1], "data_format": "channels_last", "name": "conv2d_5", "activity_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "padding": "valid", "kernel_constraint": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "conv2d_5", "class_name": "Conv2D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 108, "bias_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "strides": [1, 1], "data_format": "channels_last", "name": "conv2d_6", "activity_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "padding": "valid", "kernel_constraint": null}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "conv2d_6", "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_4", "padding": "valid"}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "max_pooling2d_4", "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_4", "rate": 0.2, "trainable": true}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "name": "dropout_4", "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 200, "bias_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "strides": [1, 1], "data_format": "channels_last", "name": "conv2d_7", "activity_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "padding": "valid", "kernel_constraint": null}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "name": "conv2d_7", "class_name": "Conv2D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 200, "bias_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "strides": [1, 1], "data_format": "channels_last", "name": "conv2d_8", "activity_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "padding": "valid", "kernel_constraint": null}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "conv2d_8", "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_6", "padding": "valid"}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "max_pooling2d_6", "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_5", "rate": 0.2, "trainable": true}, "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]], "name": "dropout_5", "class_name": "Dropout"}, {"config": {"name": "flatten_2", "trainable": true}, "inbound_nodes": [[["dropout_5", 0, 0, {}]]], "name": "flatten_2", "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 100, "bias_regularizer": null, "activation": "sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "name": "dense_3", "kernel_constraint": null}, "inbound_nodes": [[["flatten_2", 0, 0, {}]]], "name": "dense_3", "class_name": "Dense"}, {"config": {"name": "dropout_6", "rate": 0.5, "trainable": true}, "inbound_nodes": [[["dense_3", 0, 0, {}]]], "name": "dropout_6", "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 43, "bias_regularizer": null, "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "name": "dense_4", "kernel_constraint": null}, "inbound_nodes": [[["dropout_6", 0, 0, {}]]], "name": "dense_4", "class_name": "Dense"}], "output_layers": [["dense_4", 0, 0]], "name": "model_2", "input_layers": [["input_2", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.0.6", "class_name": "Model"}