{"config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["dense_2", 0, 0]], "layers": [{"config": {"dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 32, 32, 1]}, "name": "input_1", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"padding": "valid", "name": "conv2d_1", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "trainable": true, "kernel_size": [3, 3], "filters": 108, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv2d_1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"padding": "valid", "name": "conv2d_2", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "trainable": true, "kernel_size": [3, 3], "filters": 108, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv2d_2", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"config": {"padding": "valid", "name": "max_pooling2d_1", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "name": "max_pooling2d_1", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.2}, "name": "dropout_1", "class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"config": {"padding": "valid", "name": "conv2d_3", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "trainable": true, "kernel_size": [3, 3], "filters": 108, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv2d_3", "class_name": "Conv2D", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"config": {"padding": "valid", "name": "conv2d_4", "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "trainable": true, "kernel_size": [3, 3], "filters": 108, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "conv2d_4", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"config": {"padding": "valid", "name": "max_pooling2d_3", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "name": "max_pooling2d_3", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"config": {"padding": "valid", "name": "max_pooling2d_2", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "name": "max_pooling2d_2", "class_name": "MaxPooling2D", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.2}, "name": "dropout_2", "class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"config": {"name": "flatten_1", "trainable": true}, "name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"config": {"name": "flatten_2", "trainable": true}, "name": "flatten_2", "class_name": "Flatten", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"config": {"mode": "concat", "name": "merge_1", "output_shape_type": "raw", "concat_axis": 1, "dot_axes": -1, "arguments": {}, "output_mask_type": "raw", "output_shape": null, "mode_type": "raw", "output_mask": null}, "name": "merge_1", "class_name": "Merge", "inbound_nodes": [[["flatten_1", 0, 0, {"mask": [null, null]}], ["flatten_2", 0, 0, {"mask": [null, null]}]]]}, {"config": {"name": "dense_1", "bias_constraint": null, "activity_regularizer": null, "activation": "sigmoid", "trainable": true, "units": 100, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null}, "name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["merge_1", 0, 0, {}]]]}, {"config": {"name": "dropout_3", "trainable": true, "rate": 0.5}, "name": "dropout_3", "class_name": "Dropout", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"config": {"name": "dense_2", "bias_constraint": null, "activity_regularizer": null, "activation": "softmax", "trainable": true, "units": 43, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null}, "name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}]}, "backend": "tensorflow", "class_name": "Model", "keras_version": "2.0.6"}