{"keras_version": "2.0.6", "class_name": "Model", "backend": "tensorflow", "config": {"name": "model_6", "output_layers": [["dense_12", 0, 0]], "layers": [{"name": "input_6", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_6", "sparse": false, "batch_input_shape": [null, 32, 32, 1], "dtype": "float32"}}, {"name": "conv2d_21", "class_name": "Conv2D", "inbound_nodes": [[["input_6", 0, 0, {}]]], "config": {"bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "activation": "relu", "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "trainable": true, "padding": "valid", "filters": 108, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_21", "bias_regularizer": null}}, {"name": "conv2d_22", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "config": {"bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "activation": "relu", "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "trainable": true, "padding": "valid", "filters": 108, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_22", "bias_regularizer": null}}, {"name": "max_pooling2d_16", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "config": {"pool_size": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_16", "strides": [2, 2]}}, {"name": "dropout_16", "class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_16", 0, 0, {}]]], "config": {"name": "dropout_16", "trainable": true, "rate": 0.2}}, {"name": "conv2d_23", "class_name": "Conv2D", "inbound_nodes": [[["dropout_16", 0, 0, {}]]], "config": {"bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "activation": "relu", "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "trainable": true, "padding": "valid", "filters": 108, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_23", "bias_regularizer": null}}, {"name": "conv2d_24", "class_name": "Conv2D", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "config": {"bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "activation": "relu", "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "trainable": true, "padding": "valid", "filters": 108, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_24", "bias_regularizer": null}}, {"name": "max_pooling2d_18", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "config": {"pool_size": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_18", "strides": [2, 2]}}, {"name": "max_pooling2d_17", "class_name": "MaxPooling2D", "inbound_nodes": [[["dropout_16", 0, 0, {}]]], "config": {"pool_size": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_17", "strides": [2, 2]}}, {"name": "dropout_17", "class_name": "Dropout", "inbound_nodes": [[["max_pooling2d_18", 0, 0, {}]]], "config": {"name": "dropout_17", "trainable": true, "rate": 0.2}}, {"name": "flatten_11", "class_name": "Flatten", "inbound_nodes": [[["max_pooling2d_17", 0, 0, {}]]], "config": {"name": "flatten_11", "trainable": true}}, {"name": "flatten_12", "class_name": "Flatten", "inbound_nodes": [[["dropout_17", 0, 0, {}]]], "config": {"name": "flatten_12", "trainable": true}}, {"name": "merge_6", "class_name": "Merge", "inbound_nodes": [[["flatten_11", 0, 0, {"mask": [null, null]}], ["flatten_12", 0, 0, {"mask": [null, null]}]]], "config": {"output_mask": null, "output_shape": null, "concat_axis": 1, "dot_axes": -1, "output_mask_type": "raw", "mode": "concat", "name": "merge_6", "output_shape_type": "raw", "arguments": {}, "mode_type": "raw"}}, {"name": "dense_11", "class_name": "Dense", "inbound_nodes": [[["merge_6", 0, 0, {}]]], "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "sigmoid", "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "trainable": true, "kernel_constraint": null, "name": "dense_11", "bias_regularizer": null, "units": 100}}, {"name": "dropout_18", "class_name": "Dropout", "inbound_nodes": [[["dense_11", 0, 0, {}]]], "config": {"name": "dropout_18", "trainable": true, "rate": 0.5}}, {"name": "dense_12", "class_name": "Dense", "inbound_nodes": [[["dropout_18", 0, 0, {}]]], "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "softmax", "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "trainable": true, "kernel_constraint": null, "name": "dense_12", "bias_regularizer": null, "units": 43}}], "input_layers": [["input_6", 0, 0]]}}